src/Documents/ВозвратБилета/ВозвратБилета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>ВозвратБилета</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ДвижениеДенежныхСредств</registerRecords>
	<registerRecords>AccumulationRegister.ВозвратыКлиентов</registerRecords>
	<attributes>
		<name>Покупатель</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<attributes>
		<name>МаскаБилета</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаШтрафа</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>Сборы</name>
		<type>
			<types>EnumRef.ОбщиеПеречисления</types>
		</type>
	</attributes>
	<attributes>
		<name>Валюта</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</attributes>
	<attributes>
		<name>КассаБанковскийСчет</name>
		<type>
			<types>CatalogRef.Касса</types>
			<types>CatalogRef.БанковскийСчет</types>
		</type>
	</attributes>
	<attributes>
		<name>ШтрафВИнВ</name>
		<type>
			<types>Boolean</types>
		</type>
	</attributes>
	<attributes>
		<name>СуммаШтрафаВВалюте</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</attributes>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидВозврата</types>
		</type>
	</attributes>
	<tabularSections>
		<name>ВозвратБилета</name>
		<attributes>
			<name>НомерБилета</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Покупатель</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>50</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Направление</name>
			<type>
				<types>CatalogRef.Направления</types>
			</type>
		</attributes>
		<attributes>
			<name>ДатаПродажи</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ДатаВылета</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГС</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Итого</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Тариф</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АГН</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаОтАВК</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаСУБ</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Билет</name>
			<type>
				<types>CatalogRef.Билет</types>
			</type>
		</attributes>
		<attributes>
			<name>PNR</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АВК</name>
			<type>
				<types>CatalogRef.Агенство</types>
			</type>
		</attributes>
		<attributes>
			<name>Валюта</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/Enums/ВидВозврата/ВидВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ВидВозврата</name>
	<enumValues>
		<name>ДобровольныйВозврат</name>
	</enumValues>
	<enumValues>
		<name>ВынужденныйВозврат</name>
	</enumValues>
</mdclass:Enum>

src/Enums/ОбщиеПеречисления/ОбщиеПеречисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ОбщиеПеречисления</name>
	<enumValues>
		<name>СборыНеВозвращаются</name>
	</enumValues>
	<enumValues>
		<name>СборВозвращается</name>
	</enumValues>
	<enumValues>
		<name>СборыНеВозвращаются_2</name>
	</enumValues>
</mdclass:Enum>

src/Documents/ВозвратБилета/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура НайтиБилетНаСервере()
ДанныеФормы=РеквизитФормыВЗначение("Объект");
Субагент=Неопределено;
МаскиБилетов=ОбработкаТекстовыхДанных.ОчисткаПустыхСтрокДляВозврата(ДанныеФормы.МаскаБилета);
Таблица=МодульПроведенияНаСервере.ВозвратСтрокиПродаж(МаскиБилетов);
Для каждого СтрТаб из Таблица Цикл
Субагент=СтрТаб.Субагент;	
КонецЦикла;
ДанныеФормы.Покупатель=Субагент;
ДанныеФормы.ВозвратБилета.Очистить();
ДанныеФормы.ВозвратБилета.Загрузить(Таблица);
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура НайтиБилет(Команда)
	НайтиБилетНаСервере();
КонецПроцедуры

&НаСервере
Функция ВалютаОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");
	СтруктураДанных=Новый Структура;
	СтруктураВозврата=Новый Структура;
	ДатаПродажи=Неопределено;
    ФлагПроверки=Неопределено;
Для каждого СтрТаб из ДанныеФормы.ВозвратБилета Цикл
	Если ВыбранноеЗначение<>СтрТаб.ВалютаВзаиморасчетов Тогда
	ФлагПроверки=Ложь;
	СтруктураДанных.Вставить("ВалютаВзаиморасчетов",ВыбранноеЗначение);
	СтруктураДанных.Вставить("ДатаПродажи",СтрТаб.ДатаПродажи);
	СтруктураДанных.Вставить("Агенство",СтрТаб.АВК);
	ДатаПродажи=СтрТаб.ДатаПродажи;
	Иначе 	
	ФлагПроверки=Истина;
	КонецЕсли; 
КонецЦикла;
Если ФлагПроверки Тогда
СтруктураВозврата.Вставить("Флаг",Истина);
Иначе
Курс=МодульПроведенияНаСервере.ВозвратКурсаАгенств(СтруктураДанных,Истина);
СтруктураВозврата.Вставить("Курс",Курс);
СтруктураВозврата.Вставить("ДатаПродажи",ДатаПродажи);
СтруктураВозврата.Вставить("Флаг",Ложь);
КонецЕсли; 
Возврат СтруктураВозврата;
КонецФункции
&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Данные=ВалютаОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Если Данные.Флаг Тогда
	Элементы.Курс_надпись.Заголовок="";
	Элементы.Курс_Значение.Заголовок="";	
	Иначе
	Элементы.Курс_надпись.Заголовок="Курс агенства на : "+Формат(Данные.ДатаПродажи, "ДФ=dd.MM.yy");
	Элементы.Курс_Значение.Заголовок=Строка(Данные.Курс);	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
ДанныеФормы=РеквизитФормыВЗначение("Объект");
Если ДанныеФормы.ЭтоНовый() Тогда
ДанныеФормы.Валюта=Справочники.Валюта.НайтиПоНаименованию("TJS");
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ПриОткрытииНаСервере();
	Если Объект.ШтрафВИнВ Тогда
	Элементы.Валюта.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафаВВалюте.Видимость=Истина;
    Иначе
	Элементы.Валюта.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафаВВалюте.Видимость=Ложь;
	КонецЕсли;
	Если Параметры.ВидОперации="Вынужденный" Тогда
	Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидВозврата.ВынужденныйВозврат");
	Объект.Сборы=ПредопределенноеЗначение("Перечисление.ОбщиеПеречисления.СборВозвращается");
	Элементы.Сборы.ТолькоПросмотр=Истина;
	ЭтаФорма.Заголовок="Вынужденный возврат";
	ИначеЕсли Параметры.ВидОперации="Добровольный" Тогда
	Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидВозврата.ДобровольныйВозврат");
	ЭтаФорма.Заголовок="Добровольный возврат";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрафВИнВПриИзменении(Элемент)
	Если Объект.ШтрафВИнВ Тогда
	Элементы.Валюта.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафаВВалюте.Видимость=Истина;
Иначе
	Элементы.Валюта.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафаВВалюте.Видимость=Ложь;
    Объект.СуммаШтрафа=0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаШтрафаВВалютеПриИзменении(Элемент)
	Данные=ВалютаОбработкаВыбораНаСервере(Объект.Валюта);
	Объект.СуммаШтрафа=Данные.Курс*Объект.СуммаШтрафаВВалюте;
	Элементы.Курс_надпись.Заголовок="Курс агенства на : "+Формат(Данные.ДатаПродажи, "ДФ=dd.MM.yy");
	Элементы.Курс_Значение.Заголовок=Строка(Данные.Курс);
КонецПроцедуры
